import get

data = get.get_time_axis_data()

map_data = [d["data"] for d in data if d["time"] == '01/21/2020'][0]

print(map_data)

data = [
    {
        "time": "1993年",
        "data": [
            {"name": "广东", "value": [3469.0, 10.12, "广东"]},
            {"name": "江苏", "value": [2998.0, 8.75, "江苏"]},
            {"name": "山东", "value": [2770.0, 8.08, "山东"]},
            {"name": "辽宁", "value": [2011.0, 5.87, "辽宁"]},
            {"name": "浙江", "value": [1926.0, 5.62, "浙江"]},
            {"name": "河北", "value": [1691.0, 4.93, "河北"]},
            {"name": "河南", "value": [1660.0, 4.84, "河南"]},
            {"name": "上海", "value": [1519.0, 4.43, "上海"]},
            {"name": "四川", "value": [1486.0, 4.34, "四川"]},
            {"name": "湖北", "value": [1326.0, 3.87, "湖北"]},
            {"name": "湖南", "value": [1245.0, 3.63, "湖南"]},
            {"name": "黑龙江", "value": [1198.0, 3.5, "黑龙江"]},
            {"name": "福建", "value": [1114.0, 3.25, "福建"]},
            {"name": "安徽", "value": [1037.0, 3.03, "安徽"]},
            {"name": "北京", "value": [886.0, 2.59, "北京"]},
            {"name": "广西", "value": [872.0, 2.54, "广西"]},
            {"name": "云南", "value": [783.0, 2.28, "云南"]},
            {"name": "江西", "value": [723.0, 2.11, "江西"]},
            {"name": "吉林", "value": [719.0, 2.1, "吉林"]},
            {"name": "山西", "value": [680.0, 1.98, "山西"]},
            {"name": "陕西", "value": [678.0, 1.98, "陕西"]},
            {"name": "重庆", "value": [609.0, 1.78, "重庆"]},
            {"name": "天津", "value": [539.0, 1.57, "天津"]},
            {"name": "内蒙古", "value": [538.0, 1.57, "内蒙古"]},
            {"name": "新疆", "value": [495.0, 1.44, "新疆"]},
            {"name": "贵州", "value": [418.0, 1.22, "贵州"]},
            {"name": "甘肃", "value": [372.0, 1.09, "甘肃"]},
            {"name": "海南", "value": [260.0, 0.76, "海南"]},
            {"name": "青海", "value": [110.0, 0.32, "青海"]},
            {"name": "宁夏", "value": [104.0, 0.3, "宁夏"]},
            {"name": "西藏", "value": [37.0, 0.11, "西藏"]},
        ],
    }
]

map_data = [
    [[x["name"], x["value"]] for x in d["data"]] for d in data if d["time"] == "1993年"
][0]
print(map_data)